load-tests/stress-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Baseline"
    - duration: 60
      arrivalRate: 10
      name: "Ramp up"
    - duration: 120
      arrivalRate: 50
      name: "Stress test"
    - duration: 60
      arrivalRate: 100
      name: "Peak stress"
    - duration: 30
      arrivalRate: 5
      name: "Recovery"
  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery Stress Test'

scenarios:
  - name: "Database intensive operations"
    weight: 40
    flow:
      - get:
          url: "/api/employees"
          expect:
            - statusCode: [200, 401, 500]
      - think: 1
      - post:
          url: "/api/employees"
          json:
            name: "Test Employee"
            email: "test@example.com"
            position: "Developer"
          expect:
            - statusCode: [201, 400, 401, 500]
      - think: 2
      - get:
          url: "/api/attendance/reports"
          expect:
            - statusCode: [200, 401, 500]

  - name: "File upload operations"
    weight: 30
    flow:
      - post:
          url: "/api/v1/documents/upload"
          form:
            file: "test-document.pdf"
            type: "license"
          expect:
            - statusCode: [200, 400, 401, 500]
      - think: 3
      - get:
          url: "/api/v1/documents"
          expect:
            - statusCode: [200, 401, 500]

  - name: "Authentication stress"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "wrongpassword"
          expect:
            - statusCode: [401, 429, 500]
      - think: 1
      - post:
          url: "/api/auth/register"
          json:
            name: "Test User"
            email: "test@example.com"
            password: "password123"
          expect:
            - statusCode: [201, 400, 409, 500]